import {
  AlertDialog,
  AlertDialogTrigger,
  AlertDialogContent,
  AlertDialogHeader,
  AlertDialogTitle,
  AlertDialogDescription,
  AlertDialogFooter,
  AlertDialogAction,
} from "../ui/alert-dialog";
import { Input } from "../ui/input";

const AgreementDialog = () => {
  return (
    <AlertDialog>
      <div className="flex items-center py-4">
        <AlertDialogTrigger>
          <Input
            type="checkbox"
            name="agreement"
            id="agreement"
            className="accent-yellow01 mr-2 flex h-5 w-5"
            readOnly
          />
        </AlertDialogTrigger>
        <label htmlFor="agreement">ยอมรับนโยบายการจัดเก็บข้อมูลส่วนตัว</label>
      </div>
      <AlertDialogContent className="max-h-4/5 overflow-y-auto">
        <AlertDialogHeader>
          <AlertDialogTitle className="text-2xl font-medium">
            นโยบายการจัดเก็บข้อมูลส่วนบุคคล
          </AlertDialogTitle>
          <AlertDialogDescription className="text-card-foreground flex flex-col gap-2 text-left text-sm leading-6 font-medium">
            <p>
              สโมสรนิสิตคณะวิทยาศาสตร์จุฬาลงกรณ์มหาวิทยาลัย (ต่อไปนี้จะเรียกว่า
              &quot;สโมสรนิสิตฯ&quot;)
              ให้ความสำคัญต่อความปลอดภัยของข้อมูลส่วนบุคคลของท่าน
              และเพื่อช่วยให้เราปกป้องข้อมูลส่วนบุคคล
              (โดยอ้างอิงนิยามของข้อมูลส่วนบุคคลในพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
              พ.ศ. 2562) ของท่านให้ปลอดภัย
              ตามมาตรฐานสูงสุดสอดคล้องกับพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
              พ.ศ. 2562
            </p>
            <p>
              ด้วยเหตุนี้ สโมสรนิสิตฯ
              จึงขอความยินยอมจากท่านเพื่อใช้ข้อมูลส่วนบุคคลของท่าน
              ในการใช้งานเว็บไซต์ระบบพัสดุของสโมสรนิสิตฯ
              โดยขอเข้าถึงข้อมูลส่วนบุคคลของท่านผ่านระบบ Chula Single Sign-On
              (Chula SSO) ซึ่งรวมถึงชื่อ รหัสประจำตัวนิสิต ปีการศึกษา ภาควิชา
              และคณะที่ท่านสังกัด เพื่อบันทึกการขอยืมคืน
              และประโยชน์ในการติดตามการใช้งานพัสดุต่าง ๆ
              ในการใช้งานเว็บไซต์ระบบพัสดุของสโมสรนิสิตฯ
            </p>
            <p>
              <b>การเก็บข้อมูลส่วนบุคคล:</b>{" "}
              ข้อมูลส่วนบุคคลของท่านจะถูกเก็บรักษาอย่างปลอดภัย
              และถูกใช้เพื่อวัตถุประสงค์ในการใช้งานและบันทึกการขอยืมคืนพัสดุเท่านั้น
              สโมสรนิสิตฯ จะไม่เปิดเผยข้อมูลส่วนบุคคลของท่านให้กับบุคคลภายนอก
              เว้นแต่จะได้รับความยินยอมจากท่าน
              หรือหากมีข้อกำหนดตามกฎหมายที่ต้องเปิดเผยข้อมูล เช่น
              การเปิดเผยข้อมูลตามคำสั่งศาลหรือหน่วยงานที่มีอำนาจ
            </p>
            <p>
              <b>การปรับปรุงประสบการณ์ใช้งาน:</b>{" "}
              เพื่อปรับปรุงการให้บริการของเรา
              เราอาจบันทึกข้อมูลการใช้งานของท่านในระบบ เช่น
              วันที่และเวลาที่ท่านเข้าถึงเว็บไซต์
              รวมถึงข้อมูลเกี่ยวกับการใช้งานเว็บไซต์ เช่น หน้าเว็บที่ท่านเข้าชม
              และการกระทำที่ท่านทำบนเว็บไซต์
              ข้อมูลเหล่านี้จะถูกใช้เพื่อวัตถุประสงค์ในการปรับปรุงประสบการณ์การใช้งานของท่าน
              และเพื่อให้เราสามารถปรับปรุงและพัฒนาเว็บไซต์ให้ดียิ่งขึ้น
              โดยไม่ได้ระบุข้อมูลส่วนบุคคลของท่านในการวิเคราะห์ข้อมูลเหล่านี้
            </p>
            <p>
              <b>การปรับปรุงนโยบายนี้:</b>{" "}
              นโยบายความเป็นส่วนตัวนี้อาจมีการเปลี่ยนแปลงในอนาคต สโมสรนิสิตฯ
              จะประกาศการเปลี่ยนแปลงใด ๆ ผ่านช่องทางการประชาสัมพันธ์ของสโมสรฯ
              หากท่านไม่เห็นด้วยกับการเปลี่ยนแปลงใด ๆ
              ท่านมีสิทธิ์ที่จะไม่เข้าใช้งานเว็บไซต์ระบบพัสดุของสโมสรนิสิตฯ
              และสามารถติดต่อสโมสรนิสิตฯ
              เพื่อขอข้อมูลเพิ่มเติมหรือแสดงความคิดเห็นเกี่ยวกับนโยบายนี้ได้
              หากท่านมีข้อสงสัยหรือข้อคำถามเกี่ยวกับนโยบายความเป็นส่วนตัวนี้
              ท่านสามารถติดต่อสโมสรนิสิตฯ
              ได้ที่อีเมลหรือช่องทางการติดต่อที่ระบุไว้ด้านล่าง
            </p>
            <br />
            Email: smovidyachula@gmail.com
            <br />
            Facebook: สโมสรนิสิตคณะวิทยาศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย - CU
            Smovidya
            <br />
            Instagram: @smovidya_official
            <br />
          </AlertDialogDescription>
        </AlertDialogHeader>
        <AlertDialogFooter>
          <AlertDialogAction className="bg-yellow01 font-noto-sans h-10 w-full rounded-md shadow-sm">
            ตกลง
          </AlertDialogAction>
        </AlertDialogFooter>
      </AlertDialogContent>
    </AlertDialog>
  );
};

export default AgreementDialog;
